//  70. Многомерные массивы в JavaScript
// let arr = [
//   ["a", "b", "c"],
//   ["d", "e", "f"],
//   ["g", "h", "i"],
// ];

// console.log(arr[0][1]); // выведет 'b'
// console.log(arr[1][2]); // выведет 'f'

// 70.1
let arr2 = [
  ["a", "b", "c"],
  ["d", "e", "f"],
  ["g", "h", "i"],
  ["j", "k", "l"],
];

// console.log(arr2[3][2]);
// console.log(arr2[1][1]);
// console.log(arr2[2][0]);
// console.log(arr2[0][0]);
// Выведите с его помощью элементы с текстом 'l', 'e', 'g' и 'a'.

// 70.2 Обращаясь к каждому элементу массива найдите сумму всех его элементов.

let arr3 = [
  [1, 2],
  [3, 4],
  [5, 6],
];

// console.log(
//   arr3[0][0] + arr3[0][1] + arr3[1][0] + arr3[1][1] + arr3[2][0] + arr3[2][1]
// );

let arr4 = [
  [
    ["a", "b"],
    ["c", "d"],
  ],
  [
    ["e", "f"],
    ["g", "h"],
  ],
  [
    ["i", "j"],
    ["k", "l"],
  ],
];
// console.log(arr4[0][0][0]); // выведет 'a'
// console.log(arr4[2][1][0]); // выведет 'k'

// 70.3
// Обращаясь к каждому элементу массива найдите сумму всех его элементов.

let arr6 = [
  [
    [1, 2],
    [3, 4],
  ],
  [
    [5, 6],
    [7, 8],
  ],
];

// console.log(
//   arr6[0][0][0] +
//     arr6[0][0][1] +
//     arr6[0][1][0] +
//     arr6[0][1][1] +
//     arr6[1][0][0] +
//     arr6[1][0][1] +
//     arr6[1][1][0] +
//     arr6[1][1][1]
// );

// 70.4
// Вручную, без цикла, найдите сумму элементов этого массива.

let arr7 = [
  [1, 2, 3, [4, 5, [6, 7]]],
  [8, [9, 10]],
];

// console.log(
//   arr7[0][0] +
//     arr7[0][1] +
//     arr7[0][2] +
//     arr7[0][3][0] +
//     arr7[0][3][1] +
//     arr7[0][3][2][0] +
//     arr7[0][3][2][1] +
//     arr7[1][0] +
//     arr7[1][1][0] +
//     arr7[1][1][1]
// );

// 71 Перебор многомерных массивов в JavaScript
let arr8 = [
  [1, 2, 3, 4, 5],
  [6, 7, 8],
  [9, 10],
];

for (let subArr of arr8) {
  for (let elem of subArr) {
    console.log(elem);
  }
}
